Revit 2024 API
PerformanceAdviser.GetAllRuleIds Method
 Retrieves an enumeration of rule Ids.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IList<PerformanceAdviserRuleId> GetAllRuleIds()
Visual Basic
Public Function GetAllRuleIds As IList(Of PerformanceAdviserRuleId)
Visual C++
public:
IList<PerformanceAdviserRuleId^>^ GetAllRuleIds()
Return Value
 A collection of rule Ids
See Also
PerformanceAdviser Class
Autodesk.Revit.DB Namespace